{
  "DEFAULT_ERRORS": {
    "AUTHENTICATION_FAILED": "Please login to access this resource.",
    "INTERNAL_SERVER_ERROR": "Internal server error. Please try again later.",
    "LOGIN_AUTHENTICATION_FAILED": "Invalid credentials. Please check your email and password and try again.",
    "RESOURCE_NOT_FOUND": "Requested resource not found.",
    "VALIDATION_FAILED": "Validation failed. Please modify the request and try again."
  },
  "VALIDATION_ERRORS": {
    "INVALID_TILT_ANGLE": "Tilt angle must be provided and it must be in range [0, 90]",
    "INVALID_AZIMUTH_ANGLE": "Azimuth angle must be provided and it must be in range [0, 360]",
    "INVALID_RATIO_AC_TO_DC": "AC to DC ratio must be provided and it must be a positive number",
    "INVALID_INVERTER_EFFICIENCY": "Inverter efficiency must be provided and it must be in range [90, 99.5]",
    "INVALID_RATIO_GROUND_COVERAGE": "Ground coverage ratio must be provided and it must be in range [0, 3]",
    "INVALID_LOSS": "Loss in percentage must be provided and it must be in range [0, 100]",
    "INVALID_MODULE_TYPE": "Module type must be provided and it can only contain values [0, 1, 2]",
    "INVALID_ENABLE_BATTERY": "Enable battery flag can only contain values [0, 1]",
    "INVALID_ARRAY_TYPE": "Array typr must be provided and it can only contain values [0, 1, 2, 3, 4]",
    "INVALID_TIME_STEP_SELL_RATES": "Step sell rates must be provided and it can only contain values [0, 1]",
    "INVALID_CONSTANT_LOSS_ADJUSTMENT": "Constant loss adjustment must be provided and it must be in range [0, 100]",
    "INVALID_LATITUDE": "Latitude must be provided ('lat'), and it must range bw -90 to 90",
    "INVALID_LONGITUDE": "Longitude must be provided ('lon'), and it must range bw -180 to 180",
    "INVALID_ZIPCODE": "Provided zipcode is not valid",
    "INVALID_BATTERY_CHEMISTRY": "Battery chemistry flag must be provided and can only contain values [0, 1]",
    "INVALID_BATTERY_CAPACITY": "Battery capacity must be provided and it must be a positive number",
    "INVALID_BATTERY_POWER": "Battery power must be provided and it must be a positive number",
    "INVALID_BATTERY_DISPATCH": "Battery dispatch flag must be provided and can only contain values [0, 1, 4]",
    "INVALID_CHARGE_FROM_PV": "Charge from PV matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_CHARGE_FROM_GRID": "Charge from grid matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_DISCHARGE": "Discharge matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_CHARGE_FROM_GRID_PERCENT": "Charge from grid percent matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_DISCHARGE_PERCENT": "Discharge matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_MANUAL_DISPATCH_WEEKDAY": "Manual dispatch weekday matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_MANUAL_DISPATCH_WEEKEND": "Manual dispatch weekend matrix must be provided if battery is enabled and manual dispatch is chosen",
    "INVALID_DC_ARRAY_POWER": "DC array power must be provided and it must be an array",
    "INVALID_HOURLY_ENERGY": "Hourly energy must be provided and it must be an array",
    "INVALID_INVERTER_MODEL": "Inverter model must be provided and can only contain values [0, 1, 2, 3, 4]",
    "INVALID_ELECTRICAL_LOAD": "Electric load matrix must be provided",
    "INVALID_ANALYSIS_PERIOD": "Analysis period must be provided and must be positive integer",
    "INVALID_SYSTEM_USE_LIFETIME_OUTPUT": "System use lifetime output must be provided and can only contain values [0, 1]",
    "INVALID_SYSTEM_POWER": "System power must be provided and it must be an array",
    "INVALID_INFLATION_RATE": "Inflation rate must be provided and it must be an array",
    "INVALID_ANNUAL_ENERGY_DEGRADATION": "Annual energy degradation must be provided and it must be an array",
    "INVALID_MONTHLY_ACC": "Monthly account for excess generation must be provided and can only contain values [0, 1, 2, 3, 4]",
    "INVALID_YEAR_END_SALE_RATE": "Year end sale rate must be provided and it must be a positive number",
    "INVALID_MONTHLY_FIXED_CHARGE": "Monthly fixed charge must be provided and it must be a positive number",
    "INVALID_MONTHLY_MIN_CHARGE": "Monthly min charge must be provided and it must be a positive number",
    "INVALID_ANNUAL_MIN_CHARGE": "Annual min charge must be provided and it must be a positive number",
    "INVALID_NET_METERING": "Net metering must be provided and can only contain values [0, 1]",
    "INVALID_TIME_STEP_ENABLED": "Time step flag must be provided and can only contain values [0, 1]",
    "INVALID_TIME_STEP_RATES": "Time step sell rates must be provided if flag is enabled",
    "INVALID_TIME_STEP_RATES_VAL": "Time step sell matrix can only contain values [0, 1]",
    "INVALID_ENERGY_WEEKDAY_SCHEDULE": "Weekday schedule matrix must be provided and it must be an array",
    "INVALID_ENERGY_WEEKEND_SCHEDULE": "Weekend schedule matrix must be provided and it must be an array",
    "INVALID_ENERGY_RATE_STRUCTURE": "Energy rate structure matrix must be provided and it must be an array",
    "INVALID_DEMAND_CHARGE_ENABLED": "Demand charge flag must be provided and can only contain values [0, 1]",
    "INVALID_DEMAND_WEEKDAY_SCHEDULE": "Demand Weekday schedule matrix must be provided and it must be an array",
    "INVALID_DEMAND_WEEKEND_SCHEDULE": "Demand Weekday schedule matrix must be provided and it must be an array",
    "INVALID_DEMAND_RATE_STRUCTURE": "Demand rate structure matrix must be provided if flag is enabled and it must be an array",
    "INVALID_FLAT_DEMAND_STRUCTURE": "Flat demand structure must be provided if flag is enabled and it must be an array"
  },
  "MESSAGES": {
    "HEALTHCHECK": "OK"
  }
}
